<?php

namespace Database\Seeders;

use App\Models\DynamicLink;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DynamicLinkSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $dynamicLinkRecords = "INSERT INTO dynamic_links (id, title , link  , `group` , `position` , status , created_at, updated_at) VALUES
                            (1, 'خرید تتر', 'https://sarmayex.com/currencies/87/خرید-تتر', 'تتر', 0, 'enable', '2023-08-26 05:00:57', '2023-08-26 05:00:57'),
                            (2, 'فروش تتر', 'https://sarmayex.com/currencies/87/خرید-تتر', 'تتر', 0, 'enable', '2023-08-26 05:01:45', '2023-08-26 05:01:45'),
                            (3, 'قیمت تتر', 'https://sarmayex.com/currencies/87/خرید-تتر', 'تتر', 0, 'enable', '2023-08-26 05:02:05', '2023-08-26 05:02:05'),
                            (4, 'خرید بیت کوین', 'https://sarmayex.com/currencies/37/خرید-بیت-کوین', 'بیت کوین', 0, 'enable', '2023-08-26 05:02:46', '2023-08-26 05:02:46'),
                            (5, 'قیمت بیت کوین', 'https://sarmayex.com/currencies/37/خرید-بیت-کوین', 'بیت کوین', 0, 'enable', '2023-08-26 05:03:02', '2023-08-26 05:03:02'),
                            (6, 'فروش بیت کوین', 'https://sarmayex.com/currencies/37/خرید-بیت-کوین', 'بیت کوین', 0, 'enable', '2023-08-26 05:03:33', '2023-08-26 05:03:33'),
                            (7, 'تحلیل فاندامنتال', 'https://sarmayex.com/blogs/8211/fundamental-analysis', 'تحلیل فاندامنتال', 0, 'enable', '2023-08-26 05:04:28', '2023-08-26 05:04:28'),
                            (8, 'عرضه اولیه ارز دیجیتال', 'https://sarmayex.com/blogs/8191/Initial-supply-of-digital-currency', 'عرضه اولیه ارز دیجیتال', 0, 'enable', '2023-08-26 05:11:37', '2023-08-26 05:11:37'),
                            (9, 'اهرم در ارز دیجیتال', 'https://sarmayex.com/blogs/8194/Leverage', 'اهرم در ارز دیجیتال', 0, 'enable', '2023-08-26 05:12:20', '2023-08-26 05:12:20'),
                            (10, 'پراپ تریدینگ', 'https://sarmayex.com/blogs/8188/Prop-Trading', 'پراپ تریدینگ', 0, 'enable', '2023-08-26 05:12:42', '2023-08-26 05:12:42'),
                            (11, 'سیگنال ارز دیجیتال', 'https://sarmayex.com/blogs/8187/signal', 'سیگنال ارز دیجیتال', 0, 'enable', '2023-08-26 05:13:11', '2023-08-26 05:13:11'),
                            (12, 'ارز turbo', 'https://sarmayex.com/blogs/8189/Turbo', 'ارز turbo', 0, 'enable', '2023-08-26 05:13:31', '2023-08-26 05:13:31'),
                            (13, 'تحلیل سنتیمنتال', 'https://sarmayex.com/blogs/8193/sentiment-analysis', 'تحلیل سنتیمنتال', 0, 'enable', '2023-08-26 05:13:55', '2023-08-26 05:13:55'),
                            (14, 'آموزش تحلیل فاندامنتال', 'https://sarmayex.com/blogs/8212/teaching-fundamental-analysis', 'آموزش تحلیل فاندامنتال', 0, 'enable', '2023-08-26 05:14:56', '2023-08-26 05:14:56'),
                            (15, 'سرمایه گذاری در ارز دیجیتال', 'https://sarmayex.com/blogs/8195/investing-in-digital-currency', 'سرمایه گذاری در ارز دیجیتال', 0, 'enable', '2023-08-26 05:15:19', '2023-08-26 05:15:19'),
                            (16, 'خرید ریپل', 'https://sarmayex.com/currencies/1/خرید-ریپل', 'ریپل', 0, 'enable', '2023-08-26 05:16:10', '2023-08-26 05:16:10'),
                            (17, 'فروش ریپل', 'https://sarmayex.com/currencies/1/خرید-ریپل', 'ریپل', 0, 'enable', '2023-08-26 05:16:47', '2023-08-26 05:16:47'),
                            (18, 'قیمت ریپل', 'https://sarmayex.com/currencies/1/خرید-ریپل', 'ریپل', 0, 'enable', '2023-08-26 05:17:17', '2023-08-26 05:17:17'),
                            (19, 'صرافی ارز دیجیتال', 'https://sarmayex.com', 'صرافی ارز دیجیتال', 0, 'enable', '2023-08-26 05:17:48', '2023-08-26 05:17:48'),
                            (20, 'خرید ارز دیجیتال', 'https://sarmayex.com/currencies/list/sell', 'ارز دیجیتال', 0, 'enable', '2023-08-26 05:18:29', '2023-08-26 05:18:29'),
                            (21, 'قیمت ارز دیجیتال', 'https://sarmayex.com/currencies/list/sell', 'ارز دیجیتال', 0, 'enable', '2023-08-26 05:19:10', '2023-08-26 05:19:10'),
                            (22, 'فروش ارز دیجیتال', 'https://sarmayex.com/currencies/list/sell', 'ارز دیجیتال', 0, 'enable', '2023-08-26 05:19:45', '2023-08-26 05:19:45'),
                            (23, 'خرید و فروش ارز دیجیتال', 'https://sarmayex.com/currencies/list/sell', 'ارز دیجیتال', 0, 'enable', '2023-08-26 05:20:17', '2023-08-26 05:20:17'),
                            (24, 'خرید اتریوم', 'https://sarmayex.com/currencies/12/خرید-اتریوم', 'اتریوم', 0, 'enable', '2023-08-26 05:20:52', '2023-08-26 05:20:52'),
                            (25, 'قیمت اتریوم', 'https://sarmayex.com/currencies/12/خرید-اتریوم', 'اتریوم', 0, 'enable', '2023-08-26 05:21:41', '2023-08-26 05:21:41'),
                            (26, 'فروش اتریوم', 'https://sarmayex.com/currencies/12/خرید-اتریوم', 'اتریوم', 0, 'enable', '2023-08-26 05:22:20', '2023-08-26 05:22:20'),
                            (27, 'خرید ترون', 'https://sarmayex.com/currencies/2/خرید-ترون', 'ترون', 0, 'enable', '2023-08-26 05:23:03', '2023-08-26 05:23:03'),
                            (28, 'قیمت ترون', 'https://sarmayex.com/currencies/2/خرید-ترون', 'ترون', 0, 'enable', '2023-08-26 05:23:58', '2023-08-26 05:23:58'),
                            (29, 'فروش ترون', 'https://sarmayex.com/currencies/2/خرید-ترون', 'ترون', 0, 'enable', '2023-08-26 05:24:54', '2023-08-26 05:24:54'),
                            (30, 'خرید لایت کوین', 'https://sarmayex.com/currencies/24/خرید-لایت-کوین', 'لایت کوین', 0, 'enable', '2023-08-26 06:55:14', '2023-08-26 06:55:14'),
                            (31, 'قیمت لایت کوین', 'https://sarmayex.com/currencies/24/خرید-لایت-کوین', 'لایت کوین', 0, 'enable', '2023-08-26 06:55:44', '2023-08-26 06:55:44'),
                            (32, 'فروش لایت کوین', 'https://sarmayex.com/currencies/24/خرید-لایت-کوین', 'لایت کوین', 0, 'enable', '2023-08-26 06:56:21', '2023-08-26 06:56:21'),
                            (33, 'خرید کاردانو', 'https://sarmayex.com/currencies/23/خرید-کاردانو', 'کاردانو', 0, 'enable', '2023-08-26 06:58:26', '2023-08-26 06:58:26'),
                            (34, 'قیمت کاردانو', 'https://sarmayex.com/currencies/23/خرید-کاردانو', 'کاردانو', 0, 'enable', '2023-08-26 06:58:54', '2023-08-26 06:58:54'),
                            (35, 'فروش کاردانو', 'https://sarmayex.com/currencies/23/خرید-کاردانو', 'کاردانو', 0, 'enable', '2023-08-26 06:59:16', '2023-08-26 06:59:16'),
                            (36, 'خرید دوج کوین', 'https://sarmayex.com/currencies/5/خرید-دوج', 'دوج کوین', 0, 'enable', '2023-08-26 06:59:45', '2023-08-26 06:59:45'),
                            (37, 'قیمت دوج کوین', 'https://sarmayex.com/currencies/5/خرید-دوج', 'دوج کوین', 0, 'enable', '2023-08-26 07:00:19', '2023-08-26 07:00:19'),
                            (38, 'فروش دوج کوین', 'https://sarmayex.com/currencies/5/خرید-دوج', 'دوج کوین', 0, 'enable', '2023-08-26 07:00:42', '2023-08-26 07:00:42'),
                            (39, 'خرید شیبا', 'https://sarmayex.com/currencies/736/خرید-شیبا-اینو', 'شیبا', 0, 'enable', '2023-08-26 07:01:40', '2023-08-26 07:01:40'),
                            (40, 'قیمت شیبا', 'https://sarmayex.com/currencies/736/خرید-شیبا-اینو', 'شیبا', 0, 'enable', '2023-08-26 07:02:06', '2023-08-26 07:02:06'),
                            (41, 'فروش شیبا', 'https://sarmayex.com/currencies/736/خرید-شیبا-اینو', 'شیبا', 0, 'enable', '2023-08-26 07:02:36', '2023-08-26 07:02:36'),
                            (42, 'خرید پرفکت مانی', 'https://sarmayex.com/currencies/619/خرید-پرفکت-مانی-دلار', 'پرفکت مانی', 0, 'enable', '2023-08-26 07:03:12', '2023-08-26 07:03:12'),
                            (43, 'قیمت پرفکت مانی', 'https://sarmayex.com/currencies/619/خرید-پرفکت-مانی-دلار', 'پرفکت مانی', 0, 'enable', '2023-08-26 07:03:42', '2023-08-26 07:03:42'),
                            (44, 'فروش پرفکت مانی', 'https://sarmayex.com/currencies/619/خرید-پرفکت-مانی-دلار', 'پرفکت مانی', 0, 'enable', '2023-08-26 07:04:29', '2023-08-26 07:04:29'),
                            (45, 'خرید استلار', 'https://sarmayex.com/currencies/3/خرید-استلار', 'استلار', 0, 'enable', '2023-08-26 07:05:09', '2023-08-26 07:05:09'),
                            (46, 'قیمت استلار', 'https://sarmayex.com/currencies/3/خرید-استلار', 'استلار', 0, 'enable', '2023-08-26 07:05:38', '2023-08-26 07:05:38'),
                            (47, 'فروش استلار', 'https://sarmayex.com/currencies/3/خرید-استلار', 'استلار', 0, 'enable', '2023-08-26 07:06:04', '2023-08-26 07:06:04'),
                            (48, 'خرید اتریوم کلاسیک', 'https://sarmayex.com/currencies/26/خرید-اتریوم-کلاسیک', 'اتریوم کلاسیک', 0, 'enable', '2023-08-26 07:06:35', '2023-08-26 07:06:35'),
                            (49, 'قیمت اتریوم کلاسیک', 'https://sarmayex.com/currencies/26/خرید-اتریوم-کلاسیک', 'اتریوم کلاسیک', 0, 'enable', '2023-08-26 07:07:09', '2023-08-26 07:07:09'),
                            (50, 'فروش اتریوم کلاسیک', 'https://sarmayex.com/currencies/26/خرید-اتریوم-کلاسیک', 'اتریوم کلاسیک', 0, 'enable', '2023-08-26 07:08:03', '2023-08-26 07:08:03'),
                            (51, 'خرید سولانا', 'https://sarmayex.com/currencies/737/خرید-سولانا', 'سولانا', 0, 'enable', '2023-08-26 07:09:04', '2023-08-26 07:09:04'),
                            (52, 'قیمت سولانا', 'https://sarmayex.com/currencies/737/خرید-سولانا', 'سولانا', 0, 'enable', '2023-08-26 07:09:26', '2023-08-26 07:09:26'),
                            (53, 'فروش سولانا', 'https://sarmayex.com/currencies/737/خرید-سولانا', 'سولانا', 0, 'enable', '2023-08-26 07:09:55', '2023-08-26 07:09:55'),
                            (54, 'خرید بایننس کوین', 'https://sarmayex.com/currencies/21/خرید-بایننس-کوین', 'بایننس کوین', 0, 'enable', '2023-08-26 07:10:23', '2023-08-26 07:10:23'),
                            (55, 'قیمت بایننس کوین', 'https://sarmayex.com/currencies/21/خرید-بایننس-کوین', 'بایننس کوین', 0, 'enable', '2023-08-26 10:39:50', '2023-08-26 10:39:50'),
                            (56, 'فروش بایننس کوین', 'https://sarmayex.com/currencies/21/خرید-بایننس-کوین', 'بایننس کوین', 0, 'enable', '2023-08-26 10:40:33', '2023-08-26 10:40:33'),
                            (57, 'خرید لونا کلاسیک', 'https://sarmayex.com/currencies/766/خرید-لونا-کلاسیک', 'لونا کلاسیک', 0, 'enable', '2023-08-26 10:41:01', '2023-08-26 10:41:01'),
                            (58, 'فروش لونا کلاسیک', 'https://sarmayex.com/currencies/766/خرید-لونا-کلاسیک', 'لونا کلاسیک', 0, 'enable', '2023-08-26 10:41:45', '2023-08-26 10:41:45'),
                            (59, 'خرید ماتیک', 'https://sarmayex.com/currencies/689/خرید-پالیگان-ماتیک', 'ماتیک', 0, 'enable', '2023-08-26 10:42:50', '2023-08-26 10:42:50'),
                            (60, 'قیمت ماتیک', 'https://sarmayex.com/currencies/689/خرید-پالیگان-ماتیک', 'ماتیک', 0, 'enable', '2023-08-26 10:50:01', '2023-08-26 10:50:01'),
                            (61, 'فروش ماتیک', 'https://sarmayex.com/currencies/689/خرید-پالیگان-ماتیک', 'ماتیک', 0, 'enable', '2023-08-26 10:50:27', '2023-08-26 10:50:27'),
                            (62, 'خرید بیت تورنت', 'https://sarmayex.com/currencies/675/خرید-بیت-تورنت', 'بیت تورنت', 0, 'enable', '2023-08-26 10:50:57', '2023-08-26 10:50:57'),
                            (63, 'قیمت بیت تورنت', 'https://sarmayex.com/currencies/675/خرید-بیت-تورنت', 'بیت تورنت', 0, 'enable', '2023-08-26 10:51:37', '2023-08-26 10:51:37'),
                            (64, 'فروش بیت تورنت', 'https://sarmayex.com/currencies/675/خرید-بیت-تورنت', 'بیت تورنت', 0, 'enable', '2023-08-26 10:52:16', '2023-08-26 10:52:16'),
                            (65, 'خرید لونا', 'https://sarmayex.com/currencies/826/خرید-لونا', 'لونا', 0, 'enable', '2023-08-26 10:52:37', '2023-08-26 10:52:37'),
                            (66, 'قیمت لونا', 'https://sarmayex.com/currencies/826/خرید-لونا', 'لونا', 0, 'enable', '2023-08-26 10:53:03', '2023-08-26 10:53:03'),
                            (67, 'فروش لونا', 'https://sarmayex.com/currencies/826/خرید-لونا', 'لونا', 0, 'enable', '2023-08-26 10:53:23', '2023-08-26 10:53:23');";
        DB::statement($dynamicLinkRecords);
    }
}
