$dynamicLinksRecords = collect([
'تتر' => [
'title' =>
'link'  =>
'group'  =>
'position'  =>
'status'  =>
'status'  =>
],
'بیت کوین' => [

],
'تحلیل فاندامنتال' => [

],
'عرضه اولیه ارز دیجیتال' => [

],
'اهرم در ارز دیجیتال' => [

],
'پراپ تریدینگ' => [

],
'سیگنال ارز دیجیتال' => [

],
'ارز turbo' => [

],
'تحلیل سنتیمنتال' => [

],
'آموزش تحلیل فاندامنتال' => [

],
'سرمایه گذاری در ارز دیجیتال' => [

],
'ریپل' => [

],
'صرافی ارز دیجیتال' => [

],
'ارز دیجیتال' => [

],
'اتریوم' => [

],
'لایت کوین' => [

],
'کاردانو' => [

],
'دوج کوین' => [

],
'شیبا' => [

],
'پرفکت مانی' => [

],
'استلار' => [

],
'اتریوم کلاسیک' => [

],
'سولانا' => [

],
'بایننس کوین' => [

],
'لونا کلاسیک' => [

],
'ماتیک' => [

],
'بیت تورنت' => [

],
'لونا' => [

],
]);
